; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_1 ?v3 - type_1 ?v4 - type_2)
 	      (pred_4 ?v2 - object ?v4 - type_2)
	      (pred_3 ?v3 - type_1 ?v8 - type_3)
	      (pred_2 ?v3 - type_1 ?v2 - object ?v8 - type_3))

   (:action op_2
       :parameters  (?v3 - type_1 ?v7 ?v6 - type_2)
       :precondition (and  (pred_1 ?v3 ?v7))
       :effect (and  (pred_1 ?v3 ?v6)
		     (not (pred_1 ?v3 ?v7))))

   (:action op_3
       :parameters (?v3 - type_1 ?v1 - object ?v5 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_4 ?v1 ?v5) (pred_1 ?v3 ?v5) (pred_3 ?v3 ?v8))
       :effect (and (pred_2 ?v3 ?v1 ?v8)
		    (not (pred_4 ?v1 ?v5)) 
		    (not (pred_3 ?v3 ?v8))))

   (:action op_1
       :parameters (?v3 - type_1 ?v1 - object ?v5 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_2 ?v3 ?v1 ?v8) (pred_1 ?v3 ?v5))
       :effect (and (pred_4 ?v1 ?v5)
		    (pred_3 ?v3 ?v8)
		    (not (pred_2 ?v3 ?v1 ?v8)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_02 - type_1
obj_10 obj_01 - type_3
obj_04 obj_05 obj_08 obj_07 - type_2
obj_06 obj_03 obj_09 - object)
(:init
(pred_1 obj_02 obj_05)
(pred_3 obj_02 obj_10)
(pred_3 obj_02 obj_01)
(pred_4 obj_06 obj_04)
(pred_4 obj_03 obj_07)
(pred_4 obj_09 obj_04)
)
(:goal
(and
(pred_4 obj_06 obj_07)
(pred_4 obj_03 obj_04)
(pred_4 obj_09 obj_05)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_02 ?b obj_01))))
)
)

; plan
1. (op_2 obj_02 obj_05 obj_04)
   deleted: (pred_1 obj_02 obj_05)
   added: (pred_1 obj_02 obj_04)
   goals met: 0 of 3
2. (op_3 obj_02 obj_06 obj_04 obj_10)
   deleted: (pred_4 obj_06 obj_04) (pred_3 obj_02 obj_10)
   added: (pred_2 obj_02 obj_06 obj_10)
   goals met: 0 of 3
3. (op_2 obj_02 obj_04 obj_07)
   deleted: (pred_1 obj_02 obj_04)
   added: (pred_1 obj_02 obj_07)
   goals met: 0 of 3
4. (op_1 obj_02 obj_06 obj_07 obj_10)
   deleted: (pred_2 obj_02 obj_06 obj_10)
   added: (pred_4 obj_06 obj_07) (pred_3 obj_02 obj_10)
   goals met: 1 of 3
5. (op_3 obj_02 obj_03 obj_07 obj_10)
   deleted: (pred_4 obj_03 obj_07) (pred_3 obj_02 obj_10)
   added: (pred_2 obj_02 obj_03 obj_10)
   goals met: 1 of 3
6. (op_2 obj_02 obj_07 obj_04)
   deleted: (pred_1 obj_02 obj_07)
   added: (pred_1 obj_02 obj_04)
   goals met: 1 of 3
7. (op_1 obj_02 obj_03 obj_04 obj_10)
   deleted: (pred_2 obj_02 obj_03 obj_10)
   added: (pred_4 obj_03 obj_04) (pred_3 obj_02 obj_10)
   goals met: 2 of 3
8. (op_3 obj_02 obj_09 obj_04 obj_10)
   deleted: (pred_4 obj_09 obj_04) (pred_3 obj_02 obj_10)
   added: (pred_2 obj_02 obj_09 obj_10)
   goals met: 2 of 3
9. (op_2 obj_02 obj_04 obj_05)
   deleted: (pred_1 obj_02 obj_04)
   added: (pred_1 obj_02 obj_05)
   goals met: 2 of 3
10. (op_1 obj_02 obj_09 obj_05 obj_10)
   deleted: (pred_2 obj_02 obj_09 obj_10)
   added: (pred_4 obj_09 obj_05) (pred_3 obj_02 obj_10)
   goals met: 3 of 3
